In [29]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [30]:
# Read the CSV files into DataFrames.
file_path_2020 = "Resources/athletic_sales_2020.csv"
file_path_2021 = "Resources/athletic_sales_2021.csv"

# Read the CSV file into a DataFrame
athletic_sales_2020 = pd.read_csv(file_path_2020)
athletic_sales_2021 = pd.read_csv(file_path_2021)

# Display the DataFrame
print(athletic_sales_2020)
print(athletic_sales_2021)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732       1/1/20  Northeast      New York
1     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3     Foot Locker      1185732       1/1/20  Northeast      New York
4     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
1292    West Gear      1128299     12/30/20       West    California
1293    West Gear      1128299     12/30/20       West    California
1294       Kohl's      1189833     12/30/20    Midwest     Minnesota
1295       Kohl's      1189833     12/30/20    Midwest     Minnesota
1296    West Gear      1128299     12/30/20       West    California

               city                  product  price_per_unit  units_sold  \
0          New York    Men's Street Footwear              50        1200
1      Philadelphia          Women's Apparel              68          83
2      Philadelphia          Women's Apparel              75         275
3          New York    Men's Street Footwear              34         384
4      Philadelphia          Women's Apparel              53          83
...             ...                      ...             ...         ...
1292  San Francisco          Women's Apparel              72         203
1293  San Francisco          Women's Apparel              80         700
1294    Minneapolis  Women's Street Footwear              41         119
1295    Minneapolis  Women's Street Footwear              45         475
1296  San Francisco          Women's Apparel              62         245

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
1292        14616           3946.32       Online
1293       560000          84000.00       Outlet
1294         4879           2878.61       Online
1295       213750          96187.50       Outlet
1296        15190           2886.10       Outlet

[1297 rows x 12 columns]
         retailer  retailer_id invoice_date     region         state  \
0       West Gear      1128299       1/1/21       West    California
1       West Gear      1128299       1/1/21       West    California
2          Kohl's      1189833       1/1/21    Midwest       Montana
3          Kohl's      1189833       1/1/21    Midwest       Montana
4       West Gear      1128299       1/1/21       West    California
...           ...          ...          ...        ...           ...
8341  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8342  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8343       Amazon      1185732     12/31/21  Northeast         Maine
8344       Amazon      1185732     12/31/21  Northeast         Maine
8345  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

               city                  product  price_per_unit  units_sold  \
0     San Francisco  Men's Athletic Footwear              65         750
1     San Francisco  Men's Athletic Footwear              51         233
2          Billings            Men's Apparel              50         275
3          Billings            Men's Apparel              47          77
4     San Francisco  Men's Athletic Footwear              64         225
...             ...                      ...             ...         ...
8341   Philadelphia            Men's Apparel              63          47
8342   Philadelphia            Men's Apparel              46          56
8343       Portland            Men's Apparel              52          36
8344       Portland            Men's Apparel              55         125
8345   Philadelphia            Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          487500         121875.00       Outlet
1           11883           3208.41       Outlet
2          137500          82500.00       Outlet
3            3619           2714.25       Online
4           14400           5184.00       Online
...           ...               ...          ...
8341         2961           1362.06       Online
8342         2576           1004.64       Outlet
8343         1872            692.64       Online
8344        68750          17187.50       Outlet
8345       122500          42875.00       Outlet

[8346 rows x 12 columns]

In [31]:
# Display the 2020 sales DataFrame
athletic_sales_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [32]:
# Display the 2021 sales DataFrame
athletic_sales_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [33]:
# Check the 2020 sales data types.
print(athletic_sales_2020.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [34]:
# Check the 2021 sales data types.
print(athletic_sales_2021.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [35]:
athletic_sales_2020.shape

(1297, 12)

In [36]:
athletic_sales_2021.shape

(8346, 12)

In [37]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.

athletic_sales_combined_df = pd.concat([athletic_sales_2020, athletic_sales_2021], ignore_index=True)
print(athletic_sales_combined_df)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732       1/1/20  Northeast      New York
1     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3     Foot Locker      1185732       1/1/20  Northeast      New York
4     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
9638  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9639  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9640       Amazon      1185732     12/31/21  Northeast         Maine
9641       Amazon      1185732     12/31/21  Northeast         Maine
9642  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

              city                product  price_per_unit  units_sold  \
0         New York  Men's Street Footwear              50        1200
1     Philadelphia        Women's Apparel              68          83
2     Philadelphia        Women's Apparel              75         275
3         New York  Men's Street Footwear              34         384
4     Philadelphia        Women's Apparel              53          83
...            ...                    ...             ...         ...
9638  Philadelphia          Men's Apparel              63          47
9639  Philadelphia          Men's Apparel              46          56
9640      Portland          Men's Apparel              52          36
9641      Portland          Men's Apparel              55         125
9642  Philadelphia          Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
9638         2961           1362.06       Online
9639         2576           1004.64       Outlet
9640         1872            692.64       Online
9641        68750          17187.50       Outlet
9642       122500          42875.00       Outlet

[9643 rows x 12 columns]

In [38]:
# Check if any values are null.
null_columns = athletic_sales_combined_df.columns[athletic_sales_combined_df.isnull().any()]
if null_columns.empty:
    print("No columns have null values.")
else:
    print("Columns with null values:", null_columns)

No columns have null values.

In [39]:
null_columns

Index([], dtype='object')

In [40]:
# Check the data type of each column
print(athletic_sales_combined_df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [42]:
# Convert the "invoice_date" to a datetime datatype
athletic_sales_combined_df['invoice_date'] = pd.to_datetime(athletic_sales_combined_df['invoice_date'])

In [43]:
# Confirm that the "invoice_date" data type has been changed.
print(athletic_sales_combined_df.dtypes)

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [237]:
athletic_df = athletic_sales_combined_df.groupby(["region", "state", "city"]).agg(Total_Products_Sold=("units_sold", "sum"))
athletic_df.head(10)

                                   Total_Products_Sold
region  state        city
Midwest Illinois     Chicago                     25407
        Indiana      Indianapolis                26332
        Iowa         Des Moines                  23446
        Kansas       Wichita                     29463
        Michigan     Detroit                     50095
        Minnesota    Minneapolis                 20415
        Missouri     St. Louis                   36404
        Montana      Billings                    42713
        Nebraska     Omaha                       19154
        North Dakota Fargo                       22781

In [238]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
athletic_df = athletic_sales_combined_df.groupby(["region", "state", "city"]).agg(Total_Products_Sold=("units_sold", "sum"))
athletic_df.head(10)

                                   Total_Products_Sold
region  state        city
Midwest Illinois     Chicago                     25407
        Indiana      Indianapolis                26332
        Iowa         Des Moines                  23446
        Kansas       Wichita                     29463
        Michigan     Detroit                     50095
        Minnesota    Minneapolis                 20415
        Missouri     St. Louis                   36404
        Montana      Billings                    42713
        Nebraska     Omaha                       19154
        North Dakota Fargo                       22781

In [239]:
# Show the top 5 results.
sorted_df = athletic_df.sort_values(by="Total_Products_Sold", ascending=False)
top5_df = sorted_df.head(5)
print(top5_df)

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

#### Using `pivot_table`

In [56]:
athletic_sales_combined_forpivot = athletic_sales_combined_df

In [236]:
# Show the number products sold for region, state, and city.
pivot_df = athletic_sales_combined_forpivot.pivot_table(index=["region", "state", "city"], values="units_sold", aggfunc="sum")
pivot_df.rename(columns={"units_sold": "Total_Products_Sold"}, inplace=True)
pivot_df.reset_index(inplace=True)
pivot_df.head(5)

    region     state          city  Total_Products_Sold
0  Midwest  Illinois       Chicago                25407
1  Midwest   Indiana  Indianapolis                26332
2  Midwest      Iowa    Des Moines                23446
3  Midwest    Kansas       Wichita                29463
4  Midwest  Michigan       Detroit                50095

In [69]:
# Show the top 5 results.
pivot_sorted_df = pivot_df.sort_values(by="Total_Products_Sold", ascending=False)
top5_entries = pivot_sorted_df.head(5)
print(top5_entries)

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

### 3. Determine which Region had the Most Sales

In [80]:
athletic_sales_combined_df.columns

Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [88]:
mostsales_df = athletic_sales_combined_df.groupby(["region", "state", "city"]).agg(Total_Sales=("total_sales", "sum"))
mostsales_df.reset_index(inplace=True)

In [91]:
mostsales_df.rename(columns={"total_sales": "Total_Sales"}, inplace=True)
mostsales_df.reset_index(inplace=True)
mostsales_df.head()

   index   region     state          city  Total_Sales
0      0  Midwest  Illinois       Chicago      9797488
1      1  Midwest   Indiana  Indianapolis      8836198
2      2  Midwest      Iowa    Des Moines      7424011
3      3  Midwest    Kansas       Wichita      9972864
4      4  Midwest  Michigan       Detroit     18625433

In [102]:
products_sold_by_region = mostsales_df.groupby("region")["Total_Sales"].sum()
highest_region = products_sold_by_region.idxmax()
print("Total Sales by Region:")
print(products_sold_by_region)

Total Sales by Region:
region
Midwest      135649897
Northeast    186324067
South        144663181
Southeast    163171236
West         269377190
Name: Total_Sales, dtype: int64

In [103]:
print("\nThe Region with the Highest Total Sales:", highest_region)

The Region with the Highest Total Sales: West

#### Using `groupby`

In [99]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.
sales_by_region = mostsales_df.groupby("region")["Total_Sales"].sum()
highest_region = sales_by_region.idxmax()
print("Total Sales by Region:")
print(sales_by_region)

Total Sales by Region:
region
Midwest      135649897
Northeast    186324067
South        144663181
Southeast    163171236
West         269377190
Name: Total_Sales, dtype: int64

In [100]:
print("\n The Region with the Highest Total Sales:", highest_region)

 The Region with the Highest Total Sales: West

#### Using `pivot_table`

In [97]:
# Show the total sales for the products sold for each region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
# Show the top 5 results.
pivot_table = mostsales_df.pivot_table(index="region", values="Total_Sales", aggfunc="sum")
highest_region = pivot_table["Total_Sales"].idxmax()
print("Total Sales by Region:")
print(pivot_table)

Total Sales by Region:
           Total_Sales
region
Midwest      135649897
Northeast    186324067
South        144663181
Southeast    163171236
West         269377190

In [98]:
print("\n The Region with the Highest Total Sales:", highest_region)

 The Region with the Highest Total Sales: West

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [105]:
athletic_sales_combined_df.columns

Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [104]:
athletic_sales_combined_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [240]:
sales_by_retailer = athletic_sales_combined_df.groupby("retailer")["total_sales"].sum()
highest_retailer_sales = sales_by_retailer.idxmax()
print(highest_retailer_sales)

West Gear

In [241]:
print("Retailer with most sales")
highest_retailer_sales

Retailer with most sales

'West Gear'

In [112]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"

# Show the top 5 results.
sales_by_location.rename(columns={"total_sales": "Total_Sales"}, inplace=True)
sales_by_location.reset_index(inplace=True)
sales_by_location.head()

   level_0  index retailer     region          state        city  Total_Sales
0        0      0   Amazon    Midwest           Ohio    Columbus     16835873
1        1      1   Amazon  Northeast          Maine    Portland      8611395
2        2      2   Amazon  Northeast  Massachusetts      Boston      4193590
3        3      3   Amazon  Northeast  New Hampshire  Manchester     10077142
4        4      4   Amazon  Northeast        Vermont  Burlington     13380463

In [114]:
retailer_sorted_df = sales_by_location.sort_values(by="Total_Sales", ascending=False)
retailer_sorted_df.head()

,level_0,index,retailer,region,state,city,Total_Sales
103,103,103,West Gear,West,California,San Francisco,32794405
50,50,50,Kohl's,West,California,Los Angeles,25127160
22,22,22,Foot Locker,Northeast,New York,New York,25008568
109,109,109,West Gear,West,Washington,Seattle,24862675
33,33,33,Foot Locker,Southeast,South Carolina,Charleston,24822280

In [161]:
# Show the top 5 results.
top5_entries = retailer_sorted_df.head(5)
top5_entries

,level_0,index,retailer,region,state,city,Total_Sales
103,103,103,West Gear,West,California,San Francisco,32794405
50,50,50,Kohl's,West,California,Los Angeles,25127160
22,22,22,Foot Locker,Northeast,New York,New York,25008568
109,109,109,West Gear,West,Washington,Seattle,24862675
33,33,33,Foot Locker,Southeast,South Carolina,Charleston,24822280

#### Using `pivot_table`

In [17]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
# Show the top 5 results.

# I did the groupby

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [117]:
athletic_sales_combined_df.columns

Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [116]:
athletic_sales_combined_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,2020-01-01,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,2020-01-01,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [126]:
product_df = athletic_sales_combined_df.pivot_table(index="product", values="units_sold", aggfunc="sum")
print(product_df)

                           units_sold
product
Men's Apparel                  306683
Men's Athletic Footwear        435526
Men's Street Footwear          591898
Women's Apparel                433827
Women's Athletic Footwear      316813
Women's Street Footwear        392269

In [151]:
womens_athletic_footwear_df = athletic_sales_combined_df[athletic_sales_combined_df['product'] == "Women's Athletic Footwear"]
womens_athletic_footwear_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

In [152]:
womens_athletic_footwear_df.columns

Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [162]:
retailer_womens_athletic = womens_athletic_footwear_df.groupby(["retailer"])['units_sold'].sum()
retailer_womens_athletic

retailer
Amazon           22544
Foot Locker      73104
Kohl's           38094
Sports Direct    73697
Walmart          26835
West Gear        82539
Name: units_sold, dtype: int64

In [153]:
most_sold_retailer = retailer_womens_athletic.idxmax()
print("Retailer with the Most Products Sold (Women's Athletic Footwear):", most_sold_retailer)

Retailer with the Most Products Sold (Women's Athletic Footwear): West Gear

In [154]:
# Filter the sales data to get the women's athletic footwear sales data.
sales_womens_df = womens_athletic_footwear_df.pivot_table(index="product", values="total_sales", aggfunc="sum")
sales_womens_df

                           total_sales
product
Women's Athletic Footwear    106481334

In [155]:
sales_womens_region_df = womens_athletic_footwear_df.pivot_table(index="region", values="total_sales", aggfunc="sum")
sales_womens_region_df

           total_sales
region
Midwest       13444606
Northeast     19796138
South         18420722
Southeast     20302798
West          34517070

#### Using `groupby`

In [132]:
product_by_location = womens_athletic_footwear_df.groupby(["retailer", "region", "state", "city"])["units_sold"].sum()
product_by_location = product_by_location.reset_index()
product_by_location.head()

  retailer     region          state        city  units_sold
0   Amazon    Midwest           Ohio    Columbus        5801
1   Amazon  Northeast          Maine    Portland        1841
2   Amazon  Northeast  Massachusetts      Boston        1190
3   Amazon  Northeast  New Hampshire  Manchester        3109
4   Amazon  Northeast        Vermont  Burlington        4327

In [138]:
product_by_location_sorted_df = product_by_location.sort_values(by="units_sold", ascending=False)
product_by_location_sorted_df.rename(columns={"units_sold": "Womens_Footwear_Units_Sold"}, inplace=True)

top5_product = product_by_location_sorted_df.head(5)
top5_product

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

In [139]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.
top5_product

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [20]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
# Show the top 5 results.

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [207]:
invoicedate_wfootwear_df = athletic_sales_combined_df.pivot_table(index=["invoice_date"], values="total_sales", aggfunc="sum")
invoicedate_wfootwear_df.rename(columns={"total_sales": "Total Sales"}, inplace=True)

In [235]:
daily_sales = invoicedate_wfootwear_df.resample('D').sum()

daily_sales.head(10)

              Total Sales
invoice_date
2020-01-01         845141
2020-01-02         689410
2020-01-03         632573
2020-01-04         615080
2020-01-05         707829
2020-01-06         655750
2020-01-07         877176
2020-01-08         668084
2020-01-09         201829
2020-01-10         200469

In [243]:
top_10_dates = daily_sales.sort_values(by="Total Sales",ascending=False).head(10)
print("Top 10 dates with the most sales")
top_10_dates

Top 10 dates with the most sales

              Total Sales
invoice_date
2021-07-16       12261098
2021-12-16       10871121
2021-06-17       10239903
2021-08-17        9517031
2021-07-23        7689134
2021-11-17        7298791
2021-12-09        7257917
2020-04-24        7050982
2021-07-09        6854359
2021-06-24        6428692

In [219]:
sales_by_week = athletic_sales_combined_df.pivot_table(index=["invoice_date"], values="total_sales", aggfunc="sum")

In [244]:
weekly_sales = sales_by_week.resample('W').sum()
weekly_sales.rename(columns={"total_sales": "Total Sales"}, inplace=True)
top10_weeks = weekly_sales.head(10)

In [245]:
print("Top 10 weeks with the most sales")
top10_weeks
# elphys notes: why does my table not look the same as in the module picture example :(! 
# the dates are similar to the pic but not the total sales.

Top 10 weeks with the most sales

              Total Sales
invoice_date
2020-01-05        3490033
2020-01-12        2837846
2020-01-19        1410638
2020-01-26        4831822
2020-02-02        5353189
2020-02-09        6234951
2020-02-16        3235124
2020-02-23        2325075
2020-03-01        1770795
2020-03-08        5771565

In [189]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
# Optional: Rename the "total_sales" column to "Total Sales"
# Show the table.
weekly_sales.head(5)

              Total Sales
invoice_date
2020-01-05        3490033
2020-01-12        2837846
2020-01-19        1410638
2020-01-26        4831822
2020-02-02        5353189

In [205]:
# Resample the pivot table into daily bins, and get the total sales for each day.
# Sort the resampled pivot table in ascending order on "Total Sales".
sorted_invoicedate_wfootwear_df = invoicedate_wfootwear_df.sort_values(by="Total Sales", ascending=True)
sorted_invoicedate_wfootwear_df.head(10)

              Total Sales
invoice_date
2020-12-13          26922
2020-12-07          31994
2020-12-14          34529
2020-12-12          35800
2020-12-06          38484
2020-12-08          44838
2021-12-18          52752
2020-11-19          53940
2020-12-18          59368
2020-12-19          61710

In [194]:
sorted2_invoicedate_wfootwear_df = invoicedate_wfootwear_df.sort_values(by="Total Sales", ascending=False)
top_date = sorted2_invoicedate_wfootwear_df.head(10)

              Total Sales
invoice_date
2021-07-16       12261098
2021-12-16       10871121
2021-06-17       10239903
2021-08-17        9517031
2021-07-23        7689134
2021-11-17        7298791
2021-12-09        7257917
2020-04-24        7050982
2021-07-09        6854359
2021-06-24        6428692

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [23]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
# Sort the resampled pivot table in ascending order on "Total Sales".
 
# elphys notes: on the module HW, it says "Sort the resampled DataFrame in descending order to show the top 10 weeks"that generated the most women's athletic footwear sales. Your final table should look like the following image:"
# and here it says ascending

In [185]:
weekly_sales = invoicedate_wfootwear_df.resample('W').sum()
top5_weekly_sales = weekly_sales.sort_values(by="Total Sales", ascending=False)
top5_weekly_sales.head(10)
# top 5 week sales

              Total Sales
invoice_date
2021-07-11       26271380
2021-07-18       24731702
2021-12-19       24698535
2021-12-12       23250286
2021-08-22       22225401
2021-08-15       22037822
2021-06-13       21183998
2021-05-16       19779030
2021-07-25       19581545
2021-06-20       19085993

In [186]:
ascending_weekly_sales = invoicedate_wfootwear_df.resample('W').sum()
top5_weekly_sales = ascending_weekly_sales.sort_values(by="Total Sales", ascending=True)
top5_weekly_sales.head(10)

              Total Sales
invoice_date
2020-10-18         251468
2020-12-13         466322
2020-12-20         590227
2020-12-06         739673
2020-11-22         927605
2020-11-29        1024420
2020-03-29        1201449
2020-01-19        1410638
2022-01-02        1481034
2020-06-07        1481505

In [187]:
week_most_sales = weekly_sales.idxmax()
print("Week with the most", week_most_sales)

Week with the most Total Sales   2021-07-11
dtype: datetime64[ns]

In [ ]:
# elphys notes" my weekly and daily top 10 dont look the same but i am not sure why
# the dates on the table are the same as the pic on the module but not the total sales amount. 
# i tried adding unit sold and it was still not the same. 
# I tested it with total sales and also unit sold to check if it was a mistake in the module 
# and the numbers were still not the same
# what did I do wrong? :(